mongo/3node/load-c.log
Loading workload...
Starting test.
2024-04-10 01:28:15:621 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://10.142.0.4:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-10 01:28:22:342 6 sec: 1000 operations; 146.56 current ops/sec; [CLEANUP: Count=1, Max=4355, Min=4352, Avg=4354, 90=4355, 99=4355, 99.9=4355, 99.99=4355] [INSERT: Count=1000, Max=205951, Min=3576, Avg=5711.14, 90=6935, 99=9711, 99.9=15239, 99.99=205951] 
[OVERALL], RunTime(ms), 6839
[OVERALL], Throughput(ops/sec), 146.22020763269484
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 51
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7457230589267436
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 51
[TOTAL_GC_TIME_%], Time(%), 0.7457230589267436
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4354.0
[CLEANUP], MinLatency(us), 4352
[CLEANUP], MaxLatency(us), 4355
[CLEANUP], 95thPercentileLatency(us), 4355
[CLEANUP], 99thPercentileLatency(us), 4355
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 5711.144
[INSERT], MinLatency(us), 3576
[INSERT], MaxLatency(us), 205951
[INSERT], 95thPercentileLatency(us), 7587
[INSERT], 99thPercentileLatency(us), 9711
[INSERT], Return=OK, 1000